hopegeng/nc_bq79600_ads/app/tle9012/src/tle9012.c
/**
 ******************************************************************************
 * @file 	tle9012.c
 * @version V0.1.0
 * @date    2024-01-01
 * @brief	To implement the TLE9012 protocol
 ******************************************************************************
 * @attention
 *
 * <h2><center> OnzerOS&trade; SYSTEM LEVEL OPERATIONAL SOFTWARE</center></h2>
 * <h2><center>&copy; COPYRIGHT 2019 Neutron Controls</center></h2>
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *
 * !DO NOT DISTRIBUTE!
 * For evaluation only.
 * Extended license agreement required for distribution and use!
 ******************************************************************************
 */

/**
 ******************************************************************************
 *

 * @date    2024-01-01
 * @brief   Enumerate the TLE9012 network
 *
 * From section 8.2.3 of TLE9012AQU_TDS_Rev0.1.pdf:
 * The enumeration procedure is started by the microcontroller. After a wake-up
 * signal has been sent through the chain, all the devices are numbered as "#0",
 * and in this status the devices will not forward any IBCB messages except for
 * EMM signals.
 * The microcontroller will send (from either the IFH or IFL interfaces) a write
 * command to device ID#0 changing the ID from #0 to #1. With this, the first
 * device in the chain is already numbered as #1. Since it is no longer #0, the
 * first device in the chain will forward the messages further in the chain;
 * therefore the microcontroller can again send a write command to device ID#0
 * changing the ID from #0 to #2. Now the second device is already numbered as
 * #2. This task must be continued until the message is received by the opposite
 * interface on the microcontroller side (if the first message was sent from IFL
 * that will be IFH or vice versa). Issuing a number higher than the number of
 * slaves in the chain will result in no response. The last device in the chain
 * must be marked as final node.
 * Please note that the numbering in the chain must always be consecutive,
 * starting with the lowest number next to the master of the chain. Otherwise
 * there is a potential risk of clash in the communication bus.
 *
 * ============================================================================
 * When battery packs are first attached to the TLE9012s and the MCU has power
 * applied, enumeration executes with no errors (write reply frame to CONFIG
 * writes are 0x00).
 * Enumeration of 4 TLE9012 nodes
 * Tx					Rx
 * 1e 80 36 00 01 78	00
 * 1e 01 36 62			01 36 00 01 b1
 * 1e 80 36 00 02 09	00
 * 1e 02 36 76			02 36 00 02 30
 * 1e 80 36 00 03 26	00
 * 1e 03 36 9f			03 36 00 03 aa
 * 1e 80 36 08 04 6e	00
 * 1e 04 36 5e			04 36 08 04 98
 *
 * Resets of the MCU via SW2 causes errors and enumeration only sometimes
 * passes if more than 2 seconds between resets.
 * If a subsequent reset happens before the 2 second timeout the enumeration
 * usually succeeds.
 * A likely consequence of enumeration while the network is awake is a
 * non-response since nodes have already been enumerated and the zero address
 * is invalid.
 *
 * @param   net_arch - high or low side isoUART topology
 * @retval  -1: 						no node memory locations available
 * 			0 - TLE9012_MAX_DEVICES:	number of nodes enumerated
 *
 *****************************************************************************/

/* C includes */
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
/* IFX includes */
#include "Ifx_Types.h"
#include "Stm/Std/IfxStm.h"
#include "Scu/Std/IfxScuWdt.h"
#include "IfxSrc_reg.h"
#include "IfxPort_Reg.h"
#include "IfxAsclin_reg.h"
#include "Asclin/Std/IfxAsclin.h"
#include "IfxSrc_regdef.h"
#include "IfxStm_reg.h"

/* Application includes */
#include "comm.h"
#include "tle9012_reg.h"
#include "tle9012.h"
#include "can.h"
#include "board.h"
#include "shell.h"
#include "tools.h"
#include "ecu8tr_cmd.h"
#include "isouart.h"
#include "eeprom.h"

#define TLE9012_SYNCH 					(0x1Eu)
#define TLE9012_BROADCAST_DEVICE		(0x3F)
#define TLE9012_MULTI_READ				(0x31)


#define CRC_8BIT_A      (0x011d7207u)
#define CRC_3BIT_A      (0x000b2002u)

/* Timer delays as per TLE9015 and TLE9012 datasheets */
#define TLE9015_MAX_TWAKE		(0.0005f)	/* tWAKE Max. = 500 usec */
#define TLE9012_MAX_TWAKE		(0.00035f)	/* tWAKE Max. = 350 usec */
#define TLE9012_FRAME_DELAY		(0.000005f)	/* 10 bit 2Mbps frame = 5 usec */
/* The TLE9012 reply delay is 3 usec.  Pass through delays accumulate for each
 * node forward and back through the network of up to 20 nodes:
 * 3 usec + ((20 * .1 usec) * 2) = 7 usec
 * We will double that to 14 usec. */
#define TLE9012_MAX_REQ_DELAY	(0.000014f) /* 14 usec */

#define ENABLE_DEBUG    (1)
#define TLE9012_DBG( ... )                             \
    do {                                                \
        if (ENABLE_DEBUG) PRINTF(__VA_ARGS__);          \
    } while (0)

/*----- constant Member variables -----------------------------------------------------*/
static __far uint8 emm_msg[] = { 'E', 'R', 'R', 'Q' };

/*----- Member variables -----------------------------------------------------*/
static uint8 nodeNr = 0;
static __far CanPkt_t emm_canNode __align(4) =
{
		.data = (uint32_t*)emm_msg,
};
volatile static __private0 __far uint32_t errqCnt = 0x00u;

volatile static TLE9012_BITWIDTH_t tle9012_bitWidth = TLE9012_BITWIDTH_16;
extern boolean tle9012_wakeup_result;

/*----- Global variables -----------------------------------------------------*/
const static uint32 MAX_ENTRIES_TLE9012_TABLE = (0x3c);
static uint8 indirect_rd_dev = 0xFF;
static uint8 indirect_rd_reg = 0xFF;

typedef struct __packed__
{
	uint8 reg;
	uint16 revVal;
} TLE9012_REG_TABLE_t;
////volatile  TLE9012_REG_TABLE_t  tle9012_reg_table[20][MAX_ENTRIES_TLE9012_TABLE] __attribute__ ((section("NC_cpu0_dlmu")));


/*----- Protected Functions -------------------------------------------------*/
/**
 ******************************************************************************
 * CRC calculations using TriCore CRCN instruction.
 * From Tasking ctc/include.cpp/intrinsics.h:
 *	unsigned int __crcn(unsigned int d, unsigned int a, unsigned int b);
 *
 * a[2:0] contains M-1, where M is the input data with of b.
 * a[7:3] must be zero.
 * a[8] if set input data bit order of b is treated as little-endian, otherwise
 * input data bit order is treated as big-endian.
 * a[9] if set a bit-wise logical inversion is applied to both the result and
 * seed values.
 * a[11:10] must be zero.
 * a[15:12] contains N-1, where N is the CRC width in the range[1,16]
 * a[16+N-1:16] encodes the coefficients of the generator polynomial.
 * a[32:16+N-1] must be zero.
 */

