hopegeng/nc_bq79600_ads/app/tle9012/src/tle9012.c
static inline uint8 tle9012_Calc8BitCrc(uint8* data_ptr, uint8 length)
{
        uint32_t crc_result = 0u;


        while (length--)
        {
                crc_result = __crcn(crc_result, CRC_8BIT_A, (uint32_t)*data_ptr++);
        }
        return ((uint8)crc_result);
} /* END tle9012_Calc8BitCrc() */

static inline uint8 tle9012_Calc3BitCrc( uint8 data )
{
        uint32_t crc_result = __crcn(0, CRC_3BIT_A, (uint32_t)data);


        return ((uint8)crc_result);
} /* END tle9012_Calc3BitCrc() */

boolean tle9012_isWakeup( void )
{
	uint8 buffer[16];
	uint16 icvid;

	tle9012_rdReg( 1, ICVID, buffer );

	if( buffer[0] == ISOUART_COMM_SUCCESS )
	{
		icvid = (buffer[5] << 8) | buffer[6];
		if( icvid == 0xc140 )
		{
			return TRUE;
		}
	}

	return FALSE;
}

static void tle9012_triggerMeas( uint8 *pRet )
{
	TLE9012_MEAS_CTRL_Register_t meas_control;

	meas_control.U16 = 0;
	meas_control.B.CVM_BIT_WIDTH = 0x06;
	meas_control.B.BVM_BIT_WIDTH = 0x06;
	if( tle9012_bitWidth == TLE9012_BITWIDTH_10 )
	{
		meas_control.B.CVM_BIT_WIDTH = 0x00;
		meas_control.B.BVM_BIT_WIDTH = 0x00;
	}
	meas_control.B.CVM_START = 1;
	meas_control.B.BVM_START = 1;
	tle9012_wrReg( TLE9012_BROADCAST_DEVICE, MEAS_CTRL, meas_control.U16, pRet );		//Enable all 12 cells
}

static boolean tle9012_waitMeasDone( uint8 dev )
{
	TLE9012_MEAS_CTRL_Register_t meas_control;
	uint16_t tle9012TimeOut = 0;
	uint8 ret[16];

	while( tle9012TimeOut++ <= 5 )
	{
		tle9012_rdReg( dev, MEAS_CTRL, ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
			meas_control.U16 = (ret[5]<<8) | ret[6];
			if( meas_control.B.CVM_START == 0 && meas_control.B.BVM_START == 0 )
			{
				return TRUE;
			}
		}
		else
		{
			//comms has crashed try to do a wakeup
			tle9012_wakeup_result = FALSE;

			tle9012_doFullWakeup();
		}
	}

	return FALSE;
}


/**
 ******************************************************************************
 *
 * @author 	RG
 * @date   	May2021
 * @brief	Function: tle9012_faultHanlder
 * 			Handling the TLE9012 EMM fault, by sending it to the upper level.
 *
 * @param	None
 * @retval	None
 *
 *****************************************************************************/
void tle9012_faultHanlder( void )
{
	errqCnt++;
///	xcanCH0_SendBlocking( &emm_canNode );

} /* END of tle9012_faultHanlder */


/*----- Public Functions ----------------------------------------------------*/

/**
 ******************************************************************************
 *
 * @author 	RG
 * @date   	May2021
 * @brief	Function: tle9012_rdReg
 * 			Read a register from TLE9012
 * 			It supports single register read, broad cast read and multi-read.
 * 			It supports reads from either HS network or LS network
 *
 * @param	net_arch: specify the network
 * 			device: specify device
 * 			reg: specify register
 * 			pRet: return read message
 * @retval	the total bytes read
 *
 *****************************************************************************/
static volatile uint8 ray_dbg[32] = {0};
uint8 tle9012_rdReg( uint8 device, uint8 reg, uint8 *pRet )
{
	uint8 cmd[5];
	uint8 rd_buffer[32];
	uint8 rd_len;
	uint8 payloadLen;
	uint8 itemNr;


	vTaskDelay(10);

	cmd[0] = TLE9012_SYNCH;
	cmd[1] = device;
	cmd[2] = reg;
	cmd[3] = tle9012_Calc8BitCrc( cmd, 3 );
	memcpy( ray_dbg, cmd, 4 );


	isouart_write( cmd, 4 );
	delay_ms( 4 );

	isouart_getResult( rd_buffer, &rd_len );

	if( rd_len <= 4 )
	{
		TLE9012_DBG( "TLE9012 Read Timeout: device = 0x%x, reg = 0x%x\r\n", device, reg );
		pRet[0] = ISOUART_COMM_FAILURE;
		return (0x01u);
	}

	payloadLen = rd_len - 0x04;
	itemNr = payloadLen / 5;

	for( int idx = 0; idx < itemNr; idx++ )
	{
		uint8 *pPos = &(rd_buffer[4+idx*5]);
		if( tle9012_Calc8BitCrc( pPos, 4) != pPos[4] )
		{
			TLE9012_DBG( "Reading: A CRC check failed:  device = %d, reg = 0x%x\r\n", device, reg );
			pRet[0] = ISOUART_COMM_FAILURE;
			return (0x01u);
		}
	}

	*pRet++ = ISOUART_COMM_SUCCESS;
	*pRet++ = isouart_isRing();
	*pRet++ = itemNr;
	for( int idx = 0; idx < itemNr; idx++ )
	{
		uint8 *pPos = &(rd_buffer[4+idx*5]);
		memmove( (void*)pRet, pPos, 4 );
		pRet += 4;
	}


	return ( 3u+itemNr * 4u );

} 	/* END of tle9012_RdReg */



/**
 ******************************************************************************
 *
 * @author 	RG
 * @date   	May2021
 * @brief	Function: tle9012_wrReg
 * 			Write a value to TLE9012 register
 * 			It supports single register write, broad cast write
 * 			It supports writes from either HS network or LS network
 *
 * @param	net_arch: specify the network
 * 			device: specify device
 * 			reg: specify register
 * 			val: specify value to write
 * 			pRet: return read message
 * @retval	the total bytes read
 *
 *****************************************************************************/
boolean tle9012_wrReg( uint8 device, uint8 reg, uint16_t val, uint8 *pRet )
{
	uint8 cmd[6];
	uint8 rd_buffer[32];
	uint8 rd_len;
	uint8 reply;


	cmd[0] = TLE9012_SYNCH;
	cmd[1] = 0x80u | device;
	cmd[2] = reg;
	cmd[3] = (uint8)((val >> 8) & 0xFF);
	cmd[4] = (uint8)(val & 0xFF);
	cmd[5] = tle9012_Calc8BitCrc( cmd, 5 );

	isouart_write( cmd, 6 );
	delay_ms( 3 );
	isouart_getResult( rd_buffer, &rd_len );
	if( rd_len != 7 )
	{
		//PRINTF( "tle9012_wrReg failure on reception: device = %d, reg = 0x%x\r\n", device, reg );
		pRet[0] = ISOUART_COMM_FAILURE;
		return false;
	}

	reply = ( rd_buffer[6] & 0x38 ) >> 3;
	if( tle9012_Calc3BitCrc(reply) != (rd_buffer[6] & 0x03) )
	{
		TLE9012_DBG( "tle9012_wrReg failure on crc: device = %d, reg = 0x%x\r\n", device, reg );
		pRet[0] = ISOUART_COMM_FAILURE;
		return false;
	}

	pRet[0] = ISOUART_COMM_SUCCESS;
	pRet[1] = isouart_isRing();
	return true;

} /* END of tle9012_wrReg */


/**
 ******************************************************************************
 *
 * @author 	RG
 * @date   	May2021
 * @brief	Function: tle9012_enumerateNetwork
 * 			Enumerate a TLE9012 network
 * 			User can specify either automatic detection or enumeration with specified
 * 			node number
 * 			It supports enumeration from either HS network or LS network
 *
 * @param	net_arch: specify the network
 * 			adc_flag: flat to enable or disable all the cell CVM( Refer to CONFIG register bit 9 )
 * 			nodeNr: node number on the network, if == 0, automatic detection
 * 			pRet: error message
 * @retval	the total nods on the network
 *
 *****************************************************************************/
uint8 tle9012_enumerateNetwork( uint8 adc_flag, uint8 nodeNr, uint8 *pRet )
{
	uint8 devNum;
	TLE9012_OP_MODE_Register_t op_mode;

	TLE9012_DBG( "Starting enumerating the network.\r\n" );

