hopegeng/nc_bq79600_ads/app/tle9012/src/tle9012.c
	tle9012_doPulseWakeup();

	if( nodeNr == 0 )
	{
		devNum = 0;
		while( tle9012_wrReg( 0x00, CONFIG, adc_flag << 0x09 | (devNum+1), pRet ) == TRUE )
		{
			devNum += 1;
			/* Undocumented delay required between node enumerations */
			delay_ms( 10 );
		}


		if( devNum > 0 )
		{
			TLE9012_DBG( "Total %d devices found on the network.\r\n", devNum );
		}
		else
		{
			TLE9012_DBG( "Failed to find any devices on the network.\r\n" );
			return 0;
		}

		/* Set the end of the node */
		/* First to put it into sleep mode, then wake it up again */
		op_mode.U16 = 0x0u;
		op_mode.B.PD = 0x01u;
		tle9012_wrReg( devNum, OP_MODE, op_mode.U16, pRet );
		tle9012_doPulseWakeup();
		tle9012_wrReg( 0x00, CONFIG, 0x01<<11 | adc_flag << 0x09 | devNum, pRet );

		return devNum;
	}

	for( devNum = 0; devNum < nodeNr; devNum++ )
	{
		if( (devNum+1) == nodeNr )
		{
			if( tle9012_wrReg( 0x00, CONFIG, 0x01<<11 | adc_flag << 0x09 | (devNum+1), pRet ) == FALSE )
			{
				return 0;
			}
		}
		else
		{
			if( tle9012_wrReg( 0x00, CONFIG, adc_flag << 0x09 | (devNum+1), pRet ) == FALSE )
			{
				return 0;
			}
		}

		/* Undocumented delay required between node enumerations */
		delay_ms( 10 );
	}

	return nodeNr;

} /* END of tle9012_enumerateNetwork */


void tle9012_tle9015Wakeup( uint8 level )
{
	BMS_DOUT_NSLEEP( level );
}

/* This one just sends the wake up pulses to the tle9012 */
void tle9012_doPulseWakeup( )
{
	uint8 pulse[20] = { 0xFF, 0xFF, 0x00, 0x00, 0xFF, 0xFF, 0x00, 0x00, 0xFF, 0xFF, 0x00, 0x00, 0xFF, 0xFF, 0x00, 0x00, 0xFF, 0xFF, 0x00, 0x00 };

	IfxPort_setPinLow( &MODULE_P32, 5 );
	delay_ms( 10 );
	IfxPort_setPinHigh( &MODULE_P32, 5 );
	delay_ms( 10 );

	isouart_write( pulse, 20 );

	delay_ms( 5 );
}

uint8 tle9012_getNodeNr( void )
{
	return nodeNr;
}

boolean tle9012_doFullWakeup( void )
{
	uint8 ret[2];

//	if( tle9012_isWakeup() == TRUE )
	{
		tle9012_sleep();
		delay_ms( 200 );
	}

	/* Here we enable all the ADC */
	nodeNr = tle9012_enumerateNetwork( 1, 0, (uint8*)&ret );
	if( nodeNr == 0 )
	{
		return FALSE;
	}

//	tle9012_wrReg( TLE9012_BROADCAST_DEVICE, OP_MODE, 2, ret ); //placed into extended watchdog mode
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		tle9012_wrReg( TLE9012_BROADCAST_DEVICE, WDOG_CNT, 0x7F, ret );		//Maximum sleep time
	}

	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		tle9012_wrReg( TLE9012_BROADCAST_DEVICE, PART_CONFIG, 0xFFF, ret );		//Enable all 12 cells
	}

	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		tle9012_wrReg( TLE9012_BROADCAST_DEVICE, TEMP_CONF, (5<<12), ret );		//5 external temp sensors
	}


	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		return TRUE;
	}
	else
	{
		return FALSE;
	}

}

boolean tle9012_sleep( void )
{
	uint8 ret[2];
	tle9012_wrReg( TLE9012_BROADCAST_DEVICE, OP_MODE, 1, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		return TRUE;
	}
	else
	{
		return FALSE;
	}
}

boolean tle9012_readMetrics( uint8 nodeNr, ECU8TR_DATA_t *pData )
{
	uint8 ret[16];
	uint8 body_idx = 0;
	uint16 temp;


	pData->dev = nodeNr;

	tle9012_triggerMeas( ret );
	tle9012_waitMeasDone( nodeNr );
	/* Read CVM, body_idex == 0 */
	for( uint8 idx = 0; idx < 12; idx++, body_idx++ )
	{
		pData->data_body[body_idx].reg = (CVM_0+idx);
		tle9012_rdReg( nodeNr, CVM_0+idx, ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
			pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
		}
		else
		{
			TLE9012_DBG( "Failed to read value from the CVM register, set it to 0x0000\r\n" );
			pData->data_body[body_idx].reg_value = 0x0000;
			return FALSE;
		}
	}

	/* Read BVM, body_idex == 12 */
	pData->data_body[body_idx].reg = BVM;
	tle9012_rdReg( nodeNr, BVM, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the BVM register, set it to 0x0000\r\n" );
		pData->data_body[body_idx].reg_value = 0x0000;
		return FALSE;
	}
	body_idx++;

	/* Read Internal temp, body_idx == 13 */
	pData->data_body[body_idx].reg = INT_TEMP;
	tle9012_rdReg( nodeNr, INT_TEMP, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		temp = (ret[6]<<8) | ret[5];
		pData->data_body[body_idx].reg_value = temp; // internal_temp.U16&0x3FF;	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the INT_TEMP register, set it to 0x0000\r\n" );
		pData->data_body[body_idx].reg_value = 0x0000;
		return FALSE;
	}
	body_idx++;


	/* Read External temp, body_idx == 14 */
	for( uint8 idx = 0; idx < 5; idx++, body_idx++ )
	{
		pData->data_body[body_idx].reg = (EXT_TEMP_0+idx);
		tle9012_rdReg( nodeNr, EXT_TEMP_0+idx, ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
			temp = (ret[6]<<8) | ret[5];
			pData->data_body[body_idx].reg_value = temp;
		}
		else
		{
			TLE9012_DBG( "Failed to read value from the EXT_TEMP register, set it to 0x0000\r\n" );
			pData->data_body[body_idx].reg_value = 0x0000;
			return FALSE;
		}
	}

	/* Read GEN DIAG, body_idx == 19 */
	pData->data_body[body_idx].reg = GEN_DIAG;
	tle9012_rdReg( nodeNr, GEN_DIAG, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		temp = (ret[6]<<8) | ret[5];
		pData->data_body[body_idx].reg_value = temp;
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the GEN DIAG register, set it to 0x0000\r\n" );
		pData->data_body[body_idx].reg_value = 0x0000;
		return FALSE;
	}
	body_idx++;

	/* Read Indirect read, body_idx == 20 */
	if( indirect_rd_dev != 0xff && nodeNr == indirect_rd_dev )
	{
		pData->data_body[body_idx].reg = indirect_rd_reg;
		tle9012_rdReg( nodeNr, indirect_rd_reg, ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
			temp = (ret[6]<<8) | ret[5];
			pData->data_body[body_idx].reg_value = temp;
		}
		else
		{
			TLE9012_DBG( "Failed to read value from the register, set it to 0x0000\r\n" );
			pData->data_body[body_idx].reg_value = 0x0000;
			return FALSE;
		}
		body_idx++;
		indirect_rd_dev = 0xFF;
	}

	pData->body_cnt = body_idx;				//Here body_idx == 20
	return TRUE;
}

void tle9012_appyBitWidth( TLE9012_BITWIDTH_t bitWidth )
{
	tle9012_bitWidth = bitWidth;
	PRINTF( "The bit width is applied to %d\n", tle9012_bitWidth );
}

boolean tle9012_setBitWidth( int bitWidth )
{
	if( bitWidth == 10 )
	{
		tle9012_appyBitWidth( TLE9012_BITWIDTH_10 );
		eeprom_set_tle9012_resolution( TLE9012_BITWIDTH_10 );
		return TRUE;
	}

