hopegeng/nc_bq79600_ads/app/tle9012/src/tle9012.c
	if( bitWidth == 16 )
	{
		tle9012_appyBitWidth( TLE9012_BITWIDTH_16 );
		eeprom_set_tle9012_resolution( TLE9012_BITWIDTH_16 );
		return TRUE;
	}

	return FALSE;
}

boolean tle9012_resetWDT(void)
{
	uint8_t ret[2];
	boolean retVal = FALSE;

	tle9012_wrReg( TLE9012_BROADCAST_DEVICE, WDOG_CNT, 0x7F, ret );		//Maximum sleep time
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		retVal = TRUE;
	}
	return retVal;
}

TLE9012_BITWIDTH_t tle9012_getBitWidth( void )
{
	return tle9012_bitWidth;
}


boolean tle9012_readDiag( uint8 nodeIdx, ECU8TR_DATA_t *pData )
{
	uint8 ret[16];
	uint8 body_idx = 0;
	uint16 temp;
	boolean result = TRUE;

	pData->dev = nodeIdx;

	//1. Read GEN_DIAG( 0x0B )
	tle9012_rdReg( nodeIdx, GEN_DIAG, ret );
	pData->data_body[body_idx].reg = GEN_DIAG;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the GEN_DIAG register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//2. Read CELL_UV( 0x0C )
	tle9012_rdReg( nodeIdx, CELL_UV, ret );
	pData->data_body[body_idx].reg = CELL_UV;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the CELL_UV register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//3. Read EXT_TEMP_DIAG( 0x0 )
	tle9012_rdReg( nodeIdx, EXT_TEMP_DIAG, ret );
	pData->data_body[body_idx].reg = EXT_TEMP_DIAG;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the EXT_TEMP_DIAG register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//4. Read CELL_OV( 0x0D )
	tle9012_rdReg( nodeIdx, CELL_OV, ret );
	pData->data_body[body_idx].reg = CELL_OV;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the CELL_OV register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//5. Read DIAG_OL( 0x10 )
	tle9012_rdReg( nodeIdx, DIAG_OL, ret );
	pData->data_body[body_idx].reg = DIAG_OL;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the DIAG_OL register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//6. Read CELL_UV_DAC_COMP( 0x12 )
	tle9012_rdReg( nodeIdx, CELL_UV_DAC_COMP, ret );
	pData->data_body[body_idx].reg = CELL_UV_DAC_COMP;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the CELL_UV_DAC_COMP register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//7. Read CELL_OV_DAC_COMP( 0x13 )
	tle9012_rdReg( nodeIdx, CELL_OV_DAC_COMP, ret );
	pData->data_body[body_idx].reg = CELL_OV_DAC_COMP;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the CELL_OV_DAC_COMP register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//8. Read BAL_DIAG_OC( 0x33 )
	tle9012_rdReg( nodeIdx, BAL_DIAG_OC, ret );
	pData->data_body[body_idx].reg = BAL_DIAG_OC;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the BAL_DIAG_OC register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;

	//9. Read BAL_DIAG_UC( 0x33 )
	tle9012_rdReg( nodeIdx, BAL_DIAG_UC, ret );
	pData->data_body[body_idx].reg = BAL_DIAG_UC;
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		pData->data_body[body_idx].reg_value = (ret[6]<<8) | ret[5];	//Looks like the the cell volt is in big endiness already.
	}
	else
	{
		TLE9012_DBG( "Failed to read value from the BAL_DIAG_UC register.\n\r" );
		pData->data_body[body_idx].reg_value = 0xFFFF;
		result = FALSE;
	}
	body_idx++;



	pData->body_cnt = body_idx;
	return result;
}


void tle9012_apply_eeprom_conf( void )
{
	uint16 val;
	uint8 ret[2];

	for( uint8 reg_idx = 0; reg_idx < 0x5F; reg_idx++)
	{
		boolean valid;

		valid = eeprom_get_tle9012_reg( reg_idx, &val );
		if( valid )
		{
			PRINTF("Apply tle9012 persist register: reg = %d, val = 0x%x\r\n", (reg_idx+1), val );
			tle9012_wrReg( TLE9012_BROADCAST_DEVICE, (reg_idx+1), val, ret );
		}
	}
}


boolean tle9012_readSARHighLow( uint8 node, uint16 *pSARLow, uint16 *pSARHigh )
{
	uint8 ret[16];
	uint16_t tle9012TimeOut = 0;
	TLE9012_MEAS_CTRL_Register_t meas_control;

	*pSARLow = *pSARHigh = 0x00;
	meas_control.U16 = 0;
	meas_control.B.CVM_BIT_WIDTH = 0x06;
	meas_control.B.BVM_BIT_WIDTH = 0x06;
	if( tle9012_bitWidth == TLE9012_BITWIDTH_10 )
	{
		meas_control.B.CVM_BIT_WIDTH = 0x00;
		meas_control.B.BVM_BIT_WIDTH = 0x00;
	}
	meas_control.B.SAR_START = 1;
	tle9012_wrReg( node, MEAS_CTRL, meas_control.U16, ret );		//Enable all 12 cells
	if( ret[0] != ISOUART_COMM_SUCCESS )
	{
		return FALSE;
	}

	while( tle9012TimeOut++ <= 5 )
	{
		vTaskDelay( 5 );
		tle9012_rdReg( node, MEAS_CTRL, ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
			meas_control.U16 = (ret[5]<<8) | ret[6];
			if( meas_control.B.SAR_START == 0 )
			{
				tle9012_rdReg( node, SAR_LOW, ret );
				if( ret[0] == ISOUART_COMM_SUCCESS )
				{
					*pSARLow = ((ret[6]<<8) | ret[5]);
				}
				tle9012_rdReg( node, SAR_HIGH, ret );
				if( ret[0] == ISOUART_COMM_SUCCESS )
				{
					*pSARHigh = ((ret[6]<<8) | ret[5]);
				}
				return TRUE;
			}
		}
	}

	return FALSE;
}

