hopegeng/nc_bq79600_ads/app/tle9012/src/tle9012.c
boolean tle9012_readInternalTemp( uint8 node, uint16 *pTemp_1, uint16 *pTemp_2 )
{
	uint8 ret[16];
	uint16_t tle9012TimeOut = 0;
	TLE9012_MEAS_CTRL_Register_t meas_control;

	*pTemp_1 = *pTemp_2 = 0x00;
	tle9012_rdReg( node, INT_TEMP, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		*pTemp_1 = ((ret[6]<<8) | ret[5]);
	}

	tle9012_rdReg( node, INT_TEMP_2, ret );
	if( ret[0] == ISOUART_COMM_SUCCESS )
	{
		*pTemp_2 = ((ret[6]<<8) | ret[5]);
	}


	return TRUE;
}


boolean tle9012_readAll( uint8 node, ECU8TR_DATA_t* pData )
{
	uint8 ret[16];
	const uint8 reg[] = { PART_CONFIG, OL_OV_THR, TEMP_CONF, INT_OT_WARN_CONF, RR_ERR_CNT, RR_CONFIG, GEN_DIAG, CELL_UV, CELL_OV,
							DIAG_OL, REG_CRC_ERR, OP_MODE, ICVID };

	pData->body_cnt = sizeof( reg );
	pData->dev = node;
	for( int idx = 0; idx < sizeof(reg)/sizeof(uint8); idx++ )
	{
		tle9012_rdReg( node, reg[idx], ret );
		if( ret[0] == ISOUART_COMM_SUCCESS )
		{
#if 0
			tle9012_reg_table[node][idx].reg = reg[idx];
			tle9012_reg_table[node][idx].revVal = ((ret[6]<<8) | ret[5]);
#else
			pData->data_body[idx].reg = reg[idx];
			pData->data_body[idx].reg_value = ((ret[6]<<8) | ret[5]);
#endif
		}
		else
		{
			return FALSE;
		}
	}

	return TRUE;

}

void tle9012_indriect_wrReg( uint8 dev, uint8 reg, uint16 val )
{
	uint8 ret[16];

	if( dev != 0xFF )
	{
		tle9012_wrReg( dev, reg, val, ret );
	}
}

void tle9012_indriect_rdReg( uint8 dev, uint8 reg )
{
	uint8 ret[16];

	if( dev != 0xFF )
	{
		indirect_rd_reg = reg;
		indirect_rd_dev = dev;
	}
}

